<a href="https://colab.research.google.com/github/OliverRevilla/Data-Analysis-with-Python/blob/main/Fechas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
person = pd.DataFrame({'Name':['Asif','Basif','John','Hary'],
                       'DOB':['3/20/1960','3/19/1981','9/12/1999','7/12/1967'],
                       'EmpID':['E453','E983','E675','E120']})
person
person.dtypes

Name     object
DOB      object
EmpID    object
dtype: object

In [ ]:
# Change the datatype of the column to Datetime
person['DOB'] = pd.to_datetime(person['DOB'])
person.dtypes

Name             object
DOB      datetime64[ns]
EmpID            object
dtype: object

In [ ]:
# Extract Month,Day,Year,'Day of the week' and 'Week of Year' from the Date field
person['Month'] = person.DOB.dt.month
person['Day'] = person.DOB.dt.day
person['Year'] = person.DOB.dt.year
person['Week Number'] = person.DOB.dt.isocalendar().week
person['Day of week'] = person.DOB.dt.dayofweek
person['Day Name'] = pd.to_datetime(person['DOB']).dt.day_name()
person['Month Name'] = pd.to_datetime(person['DOB']).dt.month_name()
person

    Name        DOB EmpID  ...  Day of week   Day Name  Month Name
0   Asif 1960-03-20  E453  ...            6     Sunday       March
1  Basif 1981-03-19  E983  ...            3   Thursday       March
2   John 1999-09-12  E675  ...            6     Sunday   September
3   Hary 1967-07-12  E120  ...            2  Wednesday        July

[4 rows x 10 columns]

In [ ]:
#Cambiando el formato Datetime '%d/%m/%Y' using strftime()
person['DOB'] = pd.to_datetime(person['DOB']).dt.strftime('%d/%m/%Y')
person

    Name         DOB EmpID  ...  Day of week   Day Name  Month Name
0   Asif  20/03/1960  E453  ...            6     Sunday       March
1  Basif  19/03/1981  E983  ...            3   Thursday       March
2   John  12/09/1999  E675  ...            6     Sunday   September
3   Hary  12/07/1967  E120  ...            2  Wednesday        July

[4 rows x 10 columns]

In [ ]:
# Find employees who are born after 12-20-1980
from datetime import date
person[pd.to_datetime(person['DOB']) > pd.Timestamp(date(1980,12,20))]

    Name         DOB EmpID  ...  Day of week  Day Name  Month Name
1  Basif  19/03/1981  E983  ...            3  Thursday       March
2   John  12/09/1999  E675  ...            6    Sunday   September

[2 rows x 10 columns]

In [ ]:
# Find employees who are born after 12-20-1980
from datetime import date
person[pd.to_datetime(person['DOB']) > pd.Timestamp('1980/12/20')]

    Name         DOB EmpID  ...  Day of week  Day Name  Month Name
1  Basif  19/03/1981  E983  ...            3  Thursday       March
2   John  12/09/1999  E675  ...            6    Sunday   September

[2 rows x 10 columns]

In [ ]:
# Find all records where DOB is between "12-20-1980" - "12-20-2000"
from datetime import date
person[(pd.to_datetime(person['DOB']) > pd.Timestamp(date(1980,12,20)))&
       (pd.to_datetime(person['DOB']) < pd.Timestamp(date(2000,12,20)))]

    Name         DOB EmpID  ...  Day of week  Day Name  Month Name
1  Basif  19/03/1981  E983  ...            3  Thursday       March
2   John  12/09/1999  E675  ...            6    Sunday   September

[2 rows x 10 columns]

In [ ]:
# Min Date in a dataframe column
pd.to_datetime(person['DOB']).min()

Timestamp('1960-03-20 00:00:00')

In [ ]:
# Max Date in a dataframe column
pd.to_datetime(person['DOB']).max()

Timestamp('1999-12-09 00:00:00')